Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/civil_annulment/consequences_of_a_civil_annulment_of_civil_partnership.html.txt.tmx
Source language: en
Languages: ga

source: Consequences of an annulment of a civil partnership
ga: Torthaí neamhniú ar pháirtnéireacht shibhialta

source: Where your civil partnership is considered void, the legal consequences of an annulment of your civil partnership are that your civil partnership is declared to be invalid from the start
ga: Áit a shíltear go bhfuil do pháirtnéireacht shibhialta curtha ar neamhní, is iad na torthaí dlíthiúla ar neamhniú do pháirtnéireacht shibhialta ná go bhfógraítear go bhfuil sí neamhbhailí ón tús

source: Therefore, your civil partnership never legally happened
ga: Mar sin, níor tharla do pháirtnéireacht shibhialta riamh go dlíthiúil

source: The most obvious consequence of a court declaration of nullity is that you are now entitled to marry
ga: Is é an toradh is follasaí ar fhógra cúirte neamhnithe ná go bhfuil tú i dteideal anois pósadh

source: If you had already married or entered into a new civil partnership, i.e. you had married or entered into a civil partnership before an order of annulment was actually made by the court, your marriage or new civil partnership may have appeared invalid
ga: Má bhí tú tar éis pósadh nó isteach i bpáirtnéireacht shibhialta nua cheana, eadhon, phós tú nó chuaigh tú isteach i bpáirtnéireacht shibhialta sula ndearna an chúirt ordú neamhnithe iarmhír, d’fhéadfaí go raibh an chuma ar do phósadh nó páirtnéireacht nua go raibh sé neamhbhailí

source: However, once the annulment order is granted, your marriage/civil partnereship is validated , as your first civil partnership has now been declared invalid
ga: Nuair a bhronntar an t-ordú neamhnithe, áfach, tá do phósadh/pháirtnéireacht shibhialta bailíochtaithe, mar go bhfuil sé fógraithe anois go bhfuil do chéad pháirtnéireacht shibhialta neamhbhailí

source: If your civil partnership is annulled, it also means that you lose the rights that you enjoyed as a civil partner
ga: Má tá do pháirtnéireacht shibhialta curtha ar neamhní, ciallaíonn sé freisin go bhfuil na cearta ar bhain tú leas astu mar pháirtnéir sibhialta caillte agat

source: • The home that you shared with your former partner is not a shared home
ga: • Ní comhtheach atá sa teach a roinn tú le d’iar-pháirtnéir

source: If your former partner is the legal owner of the house, he or she can sell or lease it without your consent
ga: Más é do pháirtnéir úinéir dlithiúil an tí, is féidir leis nó léi é a dhíol nó a thabhairt ar léas gan do chead

source: • Under the Succession Act 1965, when a civil partner dies, the surviving civil partner is legally entitled to a share of his/her estate whether or not he or she has left a will
ga: • Faoin Acht um Chomharbas 1965, nuair a bhásann páirtnéir sibhialta, tá an páirtnéir sibhialta marthanaigh i dteideal cuid dá (h)eastát go dlíthiúil is cuma an bhfuil uacht fágtha aige nó aici nó mura bhfuil

source: As your civil partnership never happened, you do not have any succession rights if your former partner dies
ga: Mar gheall nár tharla do pháirtnéireacht shibhialta riamh, níl aon chearta comharbais agat má bhásann d’iar-pháirtnéir

source: • Once your civil partnership has been annulled, you do not have a right to apply to the court to order your former partner to pay maintenance to support you, as only civil partners may apply to a court for an order for maintenance
ga: • Nuair a chuirtear do pháirtnéireacht shibhialta ar neamhní, níl aon cheart agat cur isteach chuig an gcúirt chun d’iar-pháirtnéir a ordú cothabháil a íoc chun tacú leat, mar nach bhfuil cead ach ag páirtnéirí sibhialta cur isteach chuig cúirt d’ordú cothabhála
